/**
  ******************************************************************************
  * @file           : User_main.c
  * @brief          : 用户二次开发主入口文件
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 DRVEXO.
  * All rights reserved.
  *
  *
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "User_main.h"
#include <math.h>

/* Define ------------------------------------------------------------------*/

/* Variable ------------------------------------------------------------------*/

/* Function ------------------------------------------------------------------*/

/**
* @brief 用户二次开发主函数，系统就绪后进入并持续运行
* @param 无
* @return 无
*/
void User_main(void)
{
    float send_data[1] = {0.0f};
    float phase = 0.0f;

    while (1)
    {
        /* USART1每隔100毫秒使用DMA发送一个JustFloat正弦波数据。 */
        send_data[0] = sinf(phase);
        User_UART_Send(send_data, 1U);
        phase += 0.1f;
        HAL_Delay(100U);
    }
}
